In [3]:
import warnings
warnings.filterwarnings('ignore')

import numpy as np
import pandas as pd

In [40]:
# observations
# gt - greater than
# lt - less than 

# print(df['last_name'].value_counts().gt(1))
# print(df['last_name'].value_counts().lt(1))

In [4]:
data = {
    'worker_id': [1, 2, 3, 4, 5],
    'first_name': ['Monika', 'Niharika', 'Vishal', 'Amitah', 'Vivek'],
    'last_name': ['Arora', 'Verma', 'Singhal', 'Singh', 'Bhati'],
    'salary': [100000, 80000, 300000, 500000, 500000],
    'joining_date': ['2014-02-20 00:00:00', '2014-06-11 00:00:00', '2014-02-20 00:00:00', '2014-02-20 00:00:00', '2014-06-11 00:00:00'],
    'department': ['HR', 'Admin', 'HR', 'Admin', 'Admin']
}

df = pd.DataFrame(data)
df

   worker_id first_name last_name  salary         joining_date department
0          1     Monika     Arora  100000  2014-02-20 00:00:00         HR
1          2   Niharika     Verma   80000  2014-06-11 00:00:00      Admin
2          3     Vishal   Singhal  300000  2014-02-20 00:00:00         HR
3          4     Amitah     Singh  500000  2014-02-20 00:00:00      Admin
4          5      Vivek     Bhati  500000  2014-06-11 00:00:00      Admin

In [5]:
# observations

# idmin 
# count will give the counbt of ONLY non-null values
# sum will give the count of null and non-null values

In [6]:
#10 COUNT Questions

# How many non-null values are there in the salary column?
# Across all columns, which column has the least non-null values?
# Using the count method, how many non-null entries are there in each of the columns in the DataFrame?
# In the department column, how many non-null entries are present?

# By grouping by the department, how many non-null first_name entries are there for each department?
# Group by joining_date and count how many workers joined on each distinct date.
# How many workers have non-null last_name entries in the DataFrame?
# By filtering the DataFrame for salary above 200000, how many non-null worker_id entries are present in the filtered data?

# By grouping by both department and joining_date, how many non-null salary entries are there for each combination?
# In the df, excluding the worker_id column, which columns have exactly 5 non-null values?

In [7]:
#10 VALUE_COUNTS() Questions

# Which first_name appears the most in the dataset?
# How many unique department names are there in the dataset and what are their counts?
# Which joining_date is the most common among the workers?
# Are there any last_name values that appear more than once? If so, which ones?
# Using alue_counts(), determine how many workers have salaries equal to 500000.
# Which salary amount appears the least frequently in the dataset?
# Use value_counts() to determine the number of workers in each department and sort the output by the department names.
# How many workers have the same first_name and last_name combinations? Use value_counts() on multiple columns to determine this.
# Can you display the frequency of each unique salary value in descending order?
# Using value_counts(), how many workers joined on each unique date? Display the results in ascending order based on counts.

In [8]:
df

   worker_id first_name last_name  salary         joining_date department
0          1     Monika     Arora  100000  2014-02-20 00:00:00         HR
1          2   Niharika     Verma   80000  2014-06-11 00:00:00      Admin
2          3     Vishal   Singhal  300000  2014-02-20 00:00:00         HR
3          4     Amitah     Singh  500000  2014-02-20 00:00:00      Admin
4          5      Vivek     Bhati  500000  2014-06-11 00:00:00      Admin

In [9]:
# How many non-null values are there in the salary column?
df['salary'].count()

5

In [10]:
# Across all columns, which column has the least non-null values?
df.count().idxmax()

'worker_id'

In [11]:
# Using the count method, how many non-null 
#entries are there in each of the columns in the DataFrame?

df.count()

worker_id       5
first_name      5
last_name       5
salary          5
joining_date    5
department      5
dtype: int64

In [12]:
# In the department column, how many non-null entries are present?
df['department'].count()

5

In [13]:
# By grouping by the department, how many non-null first_name entries are there for each department?
df.groupby('department').count()

            worker_id  first_name  last_name  salary  joining_date
department
Admin               3           3          3       3             3
HR                  2           2          2       2             2

In [14]:
# Group by joining_date and count how many workers joined on each distinct date.
df.groupby('joining_date').count()

                     worker_id  first_name  last_name  salary  department
joining_date
2014-02-20 00:00:00          3           3          3       3           3
2014-06-11 00:00:00          2           2          2       2           2

In [15]:
# How many workers have non-null last_name entries in the DataFrame?
df['last_name'].count()

5

In [19]:
# By filtering the DataFrame for salary above 200000, 
# how many non-null worker_id entries are present in the filtered data?

df.loc[df['salary'] > 200000]['worker_id'].count()

3

# VALUE_COUNTS

In [21]:
# Which first_name appears the most in the dataset?
df['first_name'].value_counts()

Monika      1
Niharika    1
Vishal      1
Amitah      1
Vivek       1
Name: first_name, dtype: int64

In [26]:
# How many unique department names are there in the dataset and what are their counts?
df['department'].value_counts().count()

2

In [25]:
# Which joining_date is the most common among the workers?
df['joining_date'].value_counts().idxmax()

'2014-02-20 00:00:00'

In [36]:
# Are there any last_name values that appear more than once? If so, which ones?
df['last_name'].value_counts().gt(1)
# print(df['last_name'].duplicated().any()) another way

Arora      False
Verma      False
Singhal    False
Singh      False
Bhati      False
Name: last_name, dtype: bool

In [46]:
# Using alue_counts(), determine how many workers have salaries equal to 500000.
df[df['salary'] == 500000]['salary'].value_counts()

500000    2
Name: salary, dtype: int64

In [47]:
# Which salary amount appears the least frequently in the dataset?
df['salary'].value_counts().idxmin()

100000

In [52]:
# Use value_counts() to determine the number of workers in each department and sort the output by the department names.
df.groupby('department').count().sort_values(by = 'department')

df['department'].value_counts().sort_index()

Admin    3
HR       2
Name: department, dtype: int64

In [57]:
# How many workers have the same first_name and last_name combinations? 
# Use value_counts() on multiple columns to determine this.

df[['first_name', 'last_name']].value_counts().gt(1).any()
df[['first_name', 'last_name']].duplicated().any()

False

In [58]:
# Can you display the frequency of each unique salary value in descending order?
df['salary'].value_counts()

500000    2
100000    1
80000     1
300000    1
Name: salary, dtype: int64

In [62]:
# Using value_counts(), how many workers joined on each unique date? Display the results in ascending order based on counts.
df['joining_date'].value_counts().sort_index()  # sort by index

2014-02-20 00:00:00    3
2014-06-11 00:00:00    2
Name: joining_date, dtype: int64

In [63]:
df['joining_date'].value_counts().sort_values() # sort by values

2014-06-11 00:00:00    2
2014-02-20 00:00:00    3
Name: joining_date, dtype: int64